<?php
// $n = 10;
// $s = 0;
//оператор цикла с пост условием
// for ($i = 1; $i <= $n; $i++) {
//     $s = $s + $i;
// }
// echo $s;

// $n = 10;
// $s = 0;
// $i = 1;
// // оператор цикла с пост условием
// do {
//     $s = $s + $i;
//     $i = $i +1;
// } while ($i <= $n)

// $n = 10;
// $s = 0;
// $i = 1;
//оператор цикла с пред условием
// while ($i <= $n){
//     $s = $s + $i;
//     $i = $i +1;
// }
// echo $s;

$money = 100;
$month = 12;
$percent = 1.5;
$sum = $money;

for ($i = 1; $i <= $month; $i++) {
    $sum = $sum + ($sum / 100 * $percent);
}
echo round($sum, 2);
